trade_exp/src/Documents/СчетФактураВыданный/СчетФактураВыданный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СчетФактураВыданный</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections extendedConfigurationObject="82e55215-7a69-44c4-9d89-19f24b9ecf72">
    <name>ДокументыОснования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="f0b6a124-2f4c-418b-bd88-d90a523fc274">
      <name>ДокументОснование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ac42ab45-3880-4751-b2ba-16d4a1a37293">
      <name>ХозяйственнаяОперация</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="5abf9a9e-6610-4520-bae5-a857db5a3bf3">
      <name>СчетФактураПолученныйОтПродавца</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a826145a-b460-4910-a747-db402c59fb03">
      <name>ПорядковыеНомераСтрок</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="a96d4ac2-d10a-4fee-87a1-589480786aff">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Enums/ТипыНалогообложенияНДС/ТипыНалогообложенияНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыНалогообложенияНДС</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ПродажаОблагаетсяЕНВД</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПродажаОблагаетсяНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПродажаНеОблагаетсяНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПродажаНаЭкспорт</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВводОСВЭксплуатацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НалоговыйАгентПоНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОблагаетсяНДСУПокупателя</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="4023d8d4-9e71-4a9b-b0b9-205c28e22f29">
    <name>ЭкспортСырьевыхТоваровУслуг</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="540bf057-2915-4a0d-8b55-1833fc259d70">
    <name>ЭкспортНесырьевыхТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>МногооборотнаяТара</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Товар</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Работа</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Набор</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/ВариантыРасчетаЦенНаборов/ВариантыРасчетаЦенНаборов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВариантыРасчетаЦенНаборов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ЦенаЗадаетсяЗаНаборРаспределяетсяПоЦенам</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЦенаЗадаетсяЗаНаборРаспределяетсяПоДолям</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="95ffa208-4f6c-4263-a3c2-f5da92f7a1cd">
    <name>РассчитываетсяИзЦенКомплектующих</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/ВариантыПредставленияНаборовВПечатныхФормах/ВариантыПредставленияНаборовВПечатныхФормах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВариантыПредставленияНаборовВПечатныхФормах</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>НаборИКомплектующие</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ТолькоКомплектующие</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ТолькоНабор</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Documents/ВозвратТоваровМеждуОрганизациями/ВозвратТоваровМеждуОрганизациями.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВозвратТоваровМеждуОрганизациями</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.ТоварыОрганизацийКПередачеПеремещения</registerRecords>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РасчетыЧерезОтдельногоКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОрганизацияПолучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДокументПередачи</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДоговорПокупки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БанковскийСчетОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДоговорПродажи</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6d9381d9-07fa-4414-9cb3-702c9a599464">
    <name>ГруппаФинансовогоУчетаПолучателя</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c73a9e67-23f8-430e-9310-9f2f73bea4ec">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1e42fb69-c5c9-498b-ba51-555b5927b5a3">
    <name>НаименованиеВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2575e111-7e6c-41b1-ae26-383ee2702114">
    <name>ПокупательНеПлательщикНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>РасшифровкаПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВалютаВзаиморасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаВзаиморасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a666d11f-7191-4156-be23-0440478089a4">
      <name>ОбъектРасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="18eb5499-26fc-41e9-b146-c0a12e57440d">
      <name>КоличествоПоРНПТ</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>23</precision>
            <scale>11</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="420d18dd-76af-4c98-b1f7-683d74e902d2">
      <name>НомерГТД</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e43603b6-dde9-4bc6-92c3-1834d059735d">
      <name>ДокументПередачи</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыЗапасов</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Catalogs/ВариантыКомплектацииНоменклатуры/ВариантыКомплектацииНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВариантыКомплектацииНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <owners>Checked</owners>
  </extension>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Основной</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СодержитТовары</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СодержитУслуги</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9d4d454e-089e-4f1b-a27c-1f61f92c7089">
    <name>ВариантРасчетаЦеныНабора</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

trade_exp/src/Documents/СчетФактураВыданный/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&ИзменениеИКонтроль ("КодВидаОперации")
Функция Док_КодВидаОперации(ДокументыОснования, Покупатели, Дата, Основание = Неопределено) Экспорт
	
	Если Покупатели.Количество() > 1 Тогда
		Возврат "27";
	ИначеЕсли Покупатели.Количество() = 1 
		И Покупатели[0].Покупатель = Справочники.Контрагенты.РозничныйПокупатель Тогда
		Возврат "26";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Основание) И ДокументыОснования.Количество() > 0 Тогда
		Основание = ДокументыОснования[0].ДокументОснование;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Основание", Основание);
	Запрос.УстановитьПараметр("ТипыЗапасовСобственные", УчетНДСУПСлужебный.ТипыЗапасовСобственные());
	Запрос.УстановитьПараметр("ИдентификаторМетаданных",
		ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Документ.СчетФактураВыданный"));
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДанныеОснованийСчетовФактур.НалогообложениеНДС,
	|	ДанныеОснованийСчетовФактур.ЭтоВозврат,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА ДанныеОснованийСчетовФактур.ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.Товары)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ) КАК ЕстьТовары,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА ДанныеОснованийСчетовФактур.ТипЗапасов В (&ТипыЗапасовСобственные)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ) КАК ЕстьСобственныйТовар,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА
	|		НЕ ДанныеОснованийСчетовФактур.ТипЗапасов В (&ТипыЗапасовСобственные)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ) КАК ЕстьКомиссионныйТовар
	|ИЗ
	|	РегистрСведений.ДанныеОснованийСчетовФактур КАК ДанныеОснованийСчетовФактур
	|ГДЕ
	|	ДанныеОснованийСчетовФактур.Регистратор = &Основание
	|	И ДанныеОснованийСчетовФактур.ТипСчетаФактуры = &ИдентификаторМетаданных
	|СГРУППИРОВАТЬ ПО
	|	ДанныеОснованийСчетовФактур.НалогообложениеНДС,
	|	ДанныеОснованийСчетовФактур.ЭтоВозврат
	|УПОРЯДОЧИТЬ ПО
	|	ЕстьСобственныйТовар УБЫВ,
	|	ЕстьКомиссионныйТовар УБЫВ	
	|";
	
	КодВидаОперации = "01";
	ВерсияКодовВидовОпераций = УчетНДСКлиентСервер.ВерсияКодовВидовОпераций(?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДатаСеанса()));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если Выборка.ЭтоВозврат Тогда
			Если Выборка.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДСУПокупателя Тогда
				КодВидаОперации = "34";
			Иначе
				КодВидаОперации = ?(ВерсияКодовВидовОпераций >= 3, "01", "03");
			КонецЕсли;
		ИначеЕсли Выборка.ЕстьКомиссионныйТовар И Выборка.ЕстьСобственныйТовар Тогда
				КодВидаОперации = ?(ВерсияКодовВидовОпераций >= 3, "15", "01;04");
		ИначеЕсли Выборка.ЕстьКомиссионныйТовар Тогда
			КодВидаОперации = ?(ВерсияКодовВидовОпераций >= 3, "01", "04");
		ИначеЕсли Выборка.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДСУПокупателя Тогда
			КодВидаОперации = "34";
		Иначе
			КодВидаОперации = "01";
		КонецЕсли;
	КонецЕсли;
	#Вставка
	если  КодВидаОперации = "15" тогда
		КодВидаОперации = "01";
	конецесли;	
    #КонецВставки
	
	Возврат КодВидаОперации;
	
КонецФункции


&ИзменениеИКонтроль("СформироватьВременнуюТаблицуТоваровДляПечати")
 Процедура Док_СформироватьВременнуюТаблицуТоваровДляПечати(МенеджерВременныхТаблиц, МассивОснований, ПараметрыПечати)

	 Запрос = Новый Запрос;
	 Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;

	 ТипыОснований = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивОснований);

	 ТекстОбщейТаблицыТовары   = "";
	 ТекстыОбщейТаблицыТоваров = Новый Массив;
	 ПервыйТип                 = Истина;
	 ЕстьНаборы                = Ложь;
	 ЕстьОтчетыДавальцу        = Ложь;

	 Для Каждого ТипОснования Из ТипыОснований Цикл

		 ПараметрыЗаполнения = ПродажиСервер.ПараметрыЗаполненияВременнойТаблицыТоваров();
		 ПараметрыЗаполнения.ПересчитыватьВВалютуРегл = Не ПараметрыПечати.ПечатьВВалюте;
		 ПараметрыЗаполнения.АктуализироватьРасчеты   = Ложь;
		 ПараметрыЗаполнения.ДляСчетаФактуры          = Истина;
		 ПараметрыЗаполнения.Вставить("ПоОтчетуДавальцу", ЕстьОтчетыДавальцу);

		 ИмяОбъекта = Сред(ТипОснования.Ключ, 10);

		 Если ИмяОбъекта = "ВозвратТоваровПоставщику"
			 Или ИмяОбъекта = "ВыкупВозвратнойТарыКлиентом"
			 Или ИмяОбъекта = "ЗаписьКнигиПродаж"
			 Или ИмяОбъекта = "ПередачаТоваровМеждуОрганизациями"
			 Или ИмяОбъекта = "РеализацияТоваровУслуг" 
			 Или ИмяОбъекта = "АктВыполненныхРабот"
			 Или ИмяОбъекта = "КорректировкаРеализации"
			 Или ИмяОбъекта = "ВыкупТоваровХранителем" Тогда
			 ПараметрыЗаполнения.ВключаяНомераГТД = Истина;
		 КонецЕсли;

		 Если ИмяОбъекта = "КорректировкаРеализации" Тогда
			 ПараметрыЗаполнения.ВключаяДоКорректировки = Истина;
		 КонецЕсли;

		 МенеджерОбъекта = ОбщегоНазначенияУТ.ПолучитьМодульЛокализации(ИмяОбъекта);
		 Если МенеджерОбъекта = Неопределено Тогда
			 МенеджерОбъекта = Документы[ИмяОбъекта];
		 КонецЕсли;	
		 Если ИмяОбъекта = "ОтчетПоКомиссииМеждуОрганизациями" Тогда
			 МенеджерОбъекта.ПоместитьВременнуюТаблицуТоваровПоВознаграждению(МенеджерВременныхТаблиц, ПараметрыЗаполнения);
		 Иначе
			 МенеджерОбъекта.ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц, ПараметрыЗаполнения);
		 КонецЕсли;

		 Если ИмяОбъекта = "КорректировкаРеализации"
			 Или ИмяОбъекта = "ВозвратТоваровОтКлиента" 
			 Или ИмяОбъекта = "ВозвратТоваровМеждуОрганизациями" Тогда
			 МенеджерОбъекта.ПреобразоватьВременнуюТаблицуТоваровДляСчетаФактуры(МенеджерВременныхТаблиц);
		 КонецЕсли;

		 ТекстЗапроса =
		 "ВЫБРАТЬ
		 |	ТаблицаДокумента.Ссылка                                    КАК Ссылка,
		 |	ТаблицаДокумента.НомерСтроки                               КАК НомерСтроки,
		 |	ТаблицаДокумента.Номенклатура                              КАК Номенклатура,
		 |//ДанныеНоменклатурыПартнера
		 |	ТаблицаДокумента.Характеристика                            КАК Характеристика,
		 |	ТаблицаДокумента.Серия                                     КАК Серия,
		 |	ТаблицаДокумента.Упаковка                                  КАК Упаковка,
		 |	ТаблицаДокумента.НомерГТД                                  КАК НомерГТД,
		 |//ДанныеТНВЭД
		 |	ТаблицаДокумента.Количество                                КАК Количество,
		 |	ТаблицаДокумента.КоличествоУпаковок                        КАК КоличествоУпаковок,
		 |	ТаблицаДокумента.КоличествоПоРНПТ                          КАК КоличествоПоРНПТ,
		 |//ДанныеСуммаБезНДС
		 |	ТаблицаДокумента.СтавкаНДС                                 КАК СтавкаНДС,
		 |	ТаблицаДокумента.СуммаНДС                                  КАК СуммаНДС,
		 |//ДанныеМежценоваяРазница
		 |	%Содержание                                                КАК Содержание,
		 |//ДанныеКомиссионера
		 |//ДанныеНабора
		 |//ДанныеКорректировки
		 |//ДанныеСФ
		 |	ТаблицаДокумента.ЭтоТовар                                  КАК ЭтоТовар,
		 |	ТаблицаДокумента.ВернутьМногооборотнуюТару                 КАК ВернутьМногооборотнуюТару
		 |//ОператорПОМЕСТИТЬ
		 |ИЗ
		 |	" + ИмяОбъекта + "ТаблицаТоваров КАК ТаблицаДокумента";

		 Если ИмяОбъекта = "АктВыполненныхРабот"
			 Или ИмяОбъекта = "ВозвратТоваровПоставщику"
			 Или ИмяОбъекта = "ВыкупВозвратнойТарыКлиентом"
			 Или ИмяОбъекта = "ВыкупТоваровХранителем"
			 Или ИмяОбъекта = "ОтчетДавальцуМеждуОрганизациями"
			 Или ИмяОбъекта = "ОтчетКомиссионера"
			 Или ИмяОбъекта = "ОтчетКомитентуОЗакупках"
			 Или ИмяОбъекта = "ОтчетПоКомиссииМеждуОрганизациями"
			 Или ИмяОбъекта = "ПередачаТоваровМеждуОрганизациями"
			 #Удаление
			 Или ИмяОбъекта = "РеализацияТоваровУслуг" 
			 #КонецУдаления
			 Или ИмяОбъекта = "РеализацияУслугПрочихАктивов" Тогда
			 ТекстЗамены = "	ТаблицаДокумента.БазаНДСРегл                               КАК СуммаБезНДС,";
		 Иначе
			 ТекстЗамены = "	ТаблицаДокумента.СуммаБезНДС                               КАК СуммаБезНДС,";
		 КонецЕсли;		
		 ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ДанныеСуммаБезНДС", ТекстЗамены);

		 Если ИмяОбъекта = "АктВыполненныхРабот"
			 Или ИмяОбъекта = "СчетФактураВыданный"
			 Или ИмяОбъекта = "РеализацияТоваровУслуг" 
			 Или ИмяОбъекта = "КорректировкаРеализации" Тогда
			 ТекстЗамены = "	ТаблицаДокумента.НоменклатураПартнера             КАК НоменклатураПартнера,";
		 Иначе
			 ТекстЗамены = "	ЗНАЧЕНИЕ(Справочник.НоменклатураКонтрагентов.ПустаяСсылка) КАК НоменклатураПартнера,";
		 КонецЕсли;		
		 ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ДанныеНоменклатурыПартнера", ТекстЗамены);

		 Если ИмяОбъекта = "АктВыполненныхРабот"
			 Или ИмяОбъекта = "КорректировкаРеализации"
			 Или ИмяОбъекта = "РеализацияУслугПрочихАктивов"
			 Или ИмяОбъекта = "СчетФактураВыданный"
			 Или ИмяОбъекта = "ЗаписьКнигиПродаж" Тогда
			 ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%Содержание", "ТаблицаДокумента.Содержание");
		 Иначе
			 ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%Содержание", """""");
		 КонецЕсли;

		 Если ИмяОбъекта = "ОтчетКомиссионера" Тогда
			 ТекстЗамены =
			 "	ТаблицаДокумента.Покупатель                    КАК Покупатель,
			 |	ТаблицаДокумента.НомерСчетаФактурыКомиссионера КАК НомерСчетаФактуры,";
		 ИначеЕсли ИмяОбъекта = "РеализацияТоваровУслуг" Тогда
			 ТекстЗамены =
			 "	ТаблицаДокумента.Покупатель                    КАК Покупатель,
			 |	ТаблицаДокумента.НомерСчетаФактурыКомиссионера КАК НомерСчетаФактуры,";
		 Иначе
			 ТекстЗамены =
			 "	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Покупатель,
			 |	""""                                          КАК НомерСчетаФактуры,";
		 КонецЕсли;
		 ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ДанныеКомиссионера", ТекстЗамены);

		 Если ИмяОбъекта = "АктВыполненныхРабот" 
			 Или ИмяОбъекта = "РеализацияТоваровУслуг" 
			 Или ИмяОбъекта = "КорректировкаРеализации" 
			 ИЛИ ИмяОбъекта = "СчетФактураВыданный" Тогда
			 ЕстьНаборы = Истина;
			 ТекстЗамены =
			 "	ТаблицаДокумента.ВариантКомплектацииНоменклатуры             КАК ВариантКомплектацииНоменклатуры,
			 |	ТаблицаДокумента.ВариантПредставленияНабораВПечатныхФормах   КАК ВариантПредставленияНабораВПечатныхФормах,
			 |	ТаблицаДокумента.ВариантРасчетаЦеныНабора                    КАК ВариантРасчетаЦеныНабора,
			 |	ТаблицаДокумента.НоменклатураНабора                          КАК НоменклатураНабора,
			 |	ТаблицаДокумента.ХарактеристикаНабора                        КАК ХарактеристикаНабора,";
		 Иначе
			 ТекстЗамены =
			 "	НЕОПРЕДЕЛЕНО                                                 КАК ВариантКомплектацииНоменклатуры,
			 |	НЕОПРЕДЕЛЕНО                                                 КАК ВариантПредставленияНабораВПечатныхФормах,
			 |	НЕОПРЕДЕЛЕНО                                                 КАК ВариантРасчетаЦеныНабора,
			 |	&ПустаяНоменклатура                                          КАК НоменклатураНабора,
			 |	НЕОПРЕДЕЛЕНО                                                 КАК ХарактеристикаНабора,";
		 КонецЕсли;
		 ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ДанныеНабора", ТекстЗамены);

		 Если ИмяОбъекта = "СчетФактураВыданный" Тогда
			 ТекстЗамены =
			 "	ТаблицаДокумента.КоличествоДо                                КАК КоличествоДо,
			 |	ТаблицаДокумента.КоличествоУпаковокДо                        КАК КоличествоУпаковокДо,
			 |	ТаблицаДокумента.КоличествоПоРНПТДо                          КАК КоличествоПоРНПТДо,
			 |	ТаблицаДокумента.КоличествоПоРНПТУвеличение                  КАК КоличествоПоРНПТУвеличение,
			 |	ТаблицаДокумента.КоличествоПоРНПТУменьшение                  КАК КоличествоПоРНПТУменьшение,
			 |	ТаблицаДокумента.СуммаБезНДСДо                               КАК СуммаБезНДСДо,
			 |	ТаблицаДокумента.СуммаНДСДо                                  КАК СуммаНДСДо,
			 |	ТаблицаДокумента.МежценоваяРазницаДо                         КАК МежценоваяРазницаДо,
			 |	ТаблицаДокумента.РазницаБезНДСУвеличение                     КАК РазницаБезНДСУвеличение,
			 |	ТаблицаДокумента.РазницаБезНДСУменьшение                     КАК РазницаБезНДСУменьшение,
			 |	ТаблицаДокумента.РазницаНДСУвеличение                        КАК РазницаНДСУвеличение,
			 |	ТаблицаДокумента.РазницаНДСУменьшение                        КАК РазницаНДСУменьшение,
			 |	ТаблицаДокумента.РазницаСНДСУвеличение                       КАК РазницаСНДСУвеличение,
			 |	ТаблицаДокумента.РазницаСНДСУменьшение                       КАК РазницаСНДСУменьшение,";
		 ИначеЕсли ИмяОбъекта = "КорректировкаРеализации" Или ИмяОбъекта = "ВозвратТоваровОтКлиента" Или ИмяОбъекта = "ВозвратТоваровМеждуОрганизациями" Тогда
			 ТекстЗамены =
			 "	ТаблицаДокумента.КоличествоДо                                КАК КоличествоДо,
			 |	ТаблицаДокумента.КоличествоУпаковокДо                        КАК КоличествоУпаковокДо,
			 |	ТаблицаДокумента.КоличествоПоРНПТДо                          КАК КоличествоПоРНПТДо,
			 |	ТаблицаДокумента.КоличествоПоРНПТУвеличение                  КАК КоличествоПоРНПТУвеличение,
			 |	ТаблицаДокумента.КоличествоПоРНПТУменьшение                  КАК КоличествоПоРНПТУменьшение,
			 |	ТаблицаДокумента.СуммаБезНДСДо                               КАК СуммаБезНДСДо,
			 |	ТаблицаДокумента.СуммаНДСДо                                  КАК СуммаНДСДо,
			 |	0                                                            КАК МежценоваяРазницаДо,
			 |	ТаблицаДокумента.РазницаБезНДСУвеличение                     КАК РазницаБезНДСУвеличение,
			 |	ТаблицаДокумента.РазницаБезНДСУменьшение                     КАК РазницаБезНДСУменьшение,
			 |	ТаблицаДокумента.РазницаНДСУвеличение                        КАК РазницаНДСУвеличение,
			 |	ТаблицаДокумента.РазницаНДСУменьшение                        КАК РазницаНДСУменьшение,
			 |	ТаблицаДокумента.РазницаСНДСУвеличение                       КАК РазницаСНДСУвеличение,
			 |	ТаблицаДокумента.РазницаСНДСУменьшение                       КАК РазницаСНДСУменьшение,";
		 Иначе
			 ТекстЗамены = 
			 "	0                                                            КАК КоличествоДо,
			 |	0                                                            КАК КоличествоУпаковокДо,
			 |	0                                                            КАК КоличествоПоРНПТДо,
			 |	0                                                            КАК КоличествоПоРНПТУвеличение,
			 |	0                                                            КАК КоличествоПоРНПТУменьшение,
			 |	0                                                            КАК СуммаБезНДСДо,
			 |	0                                                            КАК СуммаНДСДо,
			 |	0                                                            КАК МежценоваяРазницаДо,
			 |	0                                                            КАК РазницаБезНДСУвеличение,
			 |	0                                                            КАК РазницаБезНДСУменьшение,
			 |	0                                                            КАК РазницаНДСУвеличение,
			 |	0                                                            КАК РазницаНДСУменьшение,
			 |	0                                                            КАК РазницаСНДСУвеличение,
			 |	0                                                            КАК РазницаСНДСУменьшение,";
		 КонецЕсли;
		 ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ДанныеКорректировки", ТекстЗамены);

		 Если ИмяОбъекта = "ЗаписьКнигиПродаж"
			 Или ИмяОбъекта = "РеализацияТоваровУслуг" 
			 Или ИмяОбъекта = "СчетФактураВыданный" 
			 Или ИмяОбъекта = "РеализацияУслугПрочихАктивов" 
			 Или ИмяОбъекта = "КорректировкаРеализации" Тогда
			 ТекстЗамены = "	ТаблицаДокумента.КодТНВЭД             КАК КодТНВЭД,";
		 Иначе
			 ТекстЗамены = "	ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка) КАК КодТНВЭД,";
		 КонецЕсли;
		 ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ДанныеТНВЭД", ТекстЗамены);

		 Если ИмяОбъекта = "ОтчетКомитентуОЗакупках" Тогда
			 ТекстЗамены = "	ТаблицаДокумента.СсылкаСФ             КАК СсылкаСФ,";
		 Иначе
			 ТекстЗамены = "	НЕОПРЕДЕЛЕНО                          КАК СсылкаСФ,";
		 КонецЕсли;
		 ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ДанныеСФ", ТекстЗамены);

		 Если ИмяОбъекта = "СчетФактураВыданный" Тогда 
			 ТекстЗамены = "	ТаблицаДокумента.МежценоваяРазница                         КАК МежценоваяРазница,";
		 Иначе
			 ТекстЗамены = "	0                         КАК МежценоваяРазница,";
		 КонецЕсли;
		 ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ДанныеМежценоваяРазница", ТекстЗамены);

		 ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		 "//ОператорПОМЕСТИТЬ", ?(ПервыйТип, "ПОМЕСТИТЬ ТаблицаТоваров", ""));

		 КолонкиВТ = МенеджерВременныхТаблиц.Таблицы[ИмяОбъекта + "ТаблицаТоваров"].Колонки; //КолонкиВременнойТаблицыЗапроса
		 Если КолонкиВТ.Найти("НомерСтрокиИсходногоСФ") = Неопределено Тогда
			 ТекстЗапроса =
			 СхемыЗапросов.ДобавитьПолеВыборкиВЗапрос(
			 ТекстЗапроса, "0", "НомерСтрокиИсходногоСФ");
		 Иначе
			 ТекстЗапроса =
			 СхемыЗапросов.ДобавитьПолеВыборкиВЗапрос(
			 ТекстЗапроса, "ТаблицаДокумента.НомерСтрокиИсходногоСФ", "НомерСтрокиИсходногоСФ");
		 КонецЕсли;

		 ТекстыОбщейТаблицыТоваров.Добавить(ТекстЗапроса);

		 ПервыйТип = Ложь;

	 КонецЦикла;

	 ТекстОбщейТаблицыТовары =
	 СтрСоединить(ТекстыОбщейТаблицыТоваров, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());

	 ТекстОбщейТаблицыТовары = ТекстОбщейТаблицыТовары + "
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |";

	 ТекстТаблицыНаборов =
	 "ВЫБРАТЬ
	 |	ТаблицаТоваров.Ссылка                                             КАК Ссылка,
	 |	ТаблицаТоваров.НоменклатураНабора                                 КАК НоменклатураНабора,
	 |	ТаблицаТоваров.ХарактеристикаНабора                               КАК ХарактеристикаНабора,
	 |	ТаблицаТоваров.СтавкаНДС                                          КАК СтавкаНДС,
	 |	МАКСИМУМ(ТаблицаТоваров.КодТНВЭД)                                 КАК КодТНВЭД,
	 |	МИНИМУМ(ТаблицаТоваров.НомерСтроки)                               КАК НомерСтроки,
	 |	МИНИМУМ(ТаблицаТоваров.НомерСтрокиИсходногоСФ)                    КАК НомерСтрокиИсходногоСФ,
	 |	СУММА(ТаблицаТоваров.СуммаБезНДСДо)                               КАК СуммаБезНДСДо,
	 |	СУММА(ТаблицаТоваров.СуммаНДСДо)                                  КАК СуммаНДСДо,
	 |	СУММА(ТаблицаТоваров.РазницаБезНДСУвеличение)                     КАК РазницаБезНДСУвеличение,
	 |	СУММА(ТаблицаТоваров.РазницаБезНДСУменьшение)                     КАК РазницаБезНДСУменьшение,
	 |	СУММА(ТаблицаТоваров.РазницаНДСУвеличение)                        КАК РазницаНДСУвеличение,
	 |	СУММА(ТаблицаТоваров.РазницаНДСУменьшение)                        КАК РазницаНДСУменьшение,
	 |	СУММА(ТаблицаТоваров.РазницаСНДСУвеличение)                       КАК РазницаСНДСУвеличение,
	 |	СУММА(ТаблицаТоваров.РазницаСНДСУменьшение)                       КАК РазницаСНДСУменьшение,
	 |	СУММА(ТаблицаТоваров.СуммаБезНДС)                                 КАК СуммаБезНДС,
	 |	СУММА(ТаблицаТоваров.СуммаНДС)                                    КАК СуммаНДС,
	 |	ТаблицаТоваров.СсылкаСФ                                           КАК СсылкаСФ,
	 |	ТаблицаТоваров.Покупатель                                         КАК Покупатель,
	 |	ТаблицаТоваров.НомерСчетаФактуры                                  КАК НомерСчетаФактуры
	 |ПОМЕСТИТЬ ВременнаяТаблицаНаборыПодготовка
	 |ИЗ
	 |	ТаблицаТоваров КАК ТаблицаТоваров
	 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК ДанныеНоменклатуры
	 |		ПО ДанныеНоменклатуры.Ссылка = ТаблицаТоваров.Номенклатура
	 |
	 |ГДЕ
	 |	ТаблицаТоваров.НоменклатураНабора <> &ПустаяНоменклатура
	 |	И (ДанныеНоменклатуры.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	 |		ИЛИ НЕ ТаблицаТоваров.ВернутьМногооборотнуюТару)
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	ТаблицаТоваров.Ссылка,
	 |	ТаблицаТоваров.НоменклатураНабора,
	 |	ТаблицаТоваров.ХарактеристикаНабора,
	 |	ТаблицаТоваров.СтавкаНДС,
	 |	ТаблицаТоваров.СсылкаСФ,
	 |	ТаблицаТоваров.Покупатель,
	 |	ТаблицаТоваров.НомерСчетаФактуры
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ РАЗЛИЧНЫЕ
	 |	ТаблицаТоваров.Ссылка КАК Ссылка
	 |ПОМЕСТИТЬ ТоварыРазличные
	 |ИЗ
	 |	ТаблицаТоваров КАК ТаблицаТоваров
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	Товары.Ссылка                                    КАК Ссылка,
	 |	Товары.ВариантКомплектацииНоменклатуры           КАК ВариантКомплектацииНоменклатуры,
	 |	Товары.ВариантПредставленияНабораВПечатныхФормах КАК ВариантПредставленияНабораВПечатныхФормах,
	 |	Товары.ВариантРасчетаЦеныНабора                  КАК ВариантРасчетаЦеныНабора,
	 |	Товары.НоменклатураНабора,
	 |	Товары.ХарактеристикаНабора,
	 |	Товары.Номенклатура,
	 |	Товары.Характеристика,
	 |	ВЫБОР КОГДА Товары.ВариантКомплектацииНоменклатуры.НоменклатураОсновногоКомпонента = Товары.Номенклатура
	 |		И Товары.ВариантКомплектацииНоменклатуры.ХарактеристикаОсновногоКомпонента = Товары.Характеристика ТОГДА
	 |		ИСТИНА
	 |	ИНАЧЕ
	 |		ЛОЖЬ
	 |	КОНЕЦ КАК ОсновнаяКомплектующая,
	 |	Товары.СтавкаНДС КАК СтавкаНДС,
	 |	ВЫБОР
	 |		КОГДА Товары.ВариантКомплектацииНоменклатуры.НоменклатураОсновногоКомпонента = Товары.Номенклатура
	 |				И Товары.ВариантКомплектацииНоменклатуры.ХарактеристикаОсновногоКомпонента = Товары.Характеристика
	 |			ТОГДА Товары.НомерГТД
	 |		ИНАЧЕ NULL
	 |	КОНЕЦ КАК НомерГТД,
	 |	0 КАК КоличествоПоУмолчанию,
	 |	Товары.КоличествоДо КАК КоличествоДо,
	 |	Товары.Количество КАК Количество,
	 |	Товары.КоличествоПоРНПТДо КАК КоличествоПоРНПТДо,
	 |	Товары.КоличествоПоРНПТУвеличение КАК КоличествоПоРНПТУвеличение,
	 |	Товары.КоличествоПоРНПТУменьшение КАК КоличествоПоРНПТУменьшение,
	 |	Товары.КоличествоПоРНПТ КАК КоличествоПоРНПТ
	 |ПОМЕСТИТЬ ВременнаяТаблицаНаборыДополнительноЧастьПервая
	 |ИЗ
	 |	ТаблицаТоваров КАК Товары
	 |
	 |ГДЕ
	 |	Товары.НоменклатураНабора <> &ПустаяНоменклатура
	 |
	 |ОБЪЕДИНИТЬ ВСЕ
	 |
	 |ВЫБРАТЬ
	 |	ТоварыРазличные.Ссылка                                                                  КАК Ссылка,
	 |	ВариантыКомплектацииНоменклатурыТовары.Ссылка                                           КАК ВариантКомплектацииНоменклатуры,
	 |	ВариантыКомплектацииНоменклатурыТовары.Ссылка.ВариантПредставленияНабораВПечатныхФормах КАК ВариантПредставленияНабораВПечатныхФормах,
	 |	ВариантыКомплектацииНоменклатурыТовары.Ссылка.ВариантРасчетаЦеныНабора                  КАК ВариантРасчетаЦеныНабора,
	 |	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец                                  КАК НоменклатураНабора,
	 |	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Характеристика                            КАК ХарактеристикаНабора,
	 |	ВариантыКомплектацииНоменклатурыТовары.Номенклатура   КАК Номенклатура,
	 |	ВариантыКомплектацииНоменклатурыТовары.Характеристика КАК Характеристика,
	 |	ЛОЖЬ КАК ОсновнаяКомплектующая,
	 |	НЕОПРЕДЕЛЕНО КАК СтавкаНДС,
	 |	NULL КАК НомерГТД,
	 |	СУММА(ВариантыКомплектацииНоменклатурыТовары.Количество) КАК КоличествоПоУмолчанию,
	 |	0 КАК КоличествоДо,
	 |	0 КАК Количество,
	 |	0 КАК КоличествоПоРНПТДо,
	 |	0 КАК КоличествоПоРНПТУвеличение,
	 |	0 КАК КоличествоПоРНПТУменьшение,
	 |	0 КАК КоличествоПоРНПТ
	 |ИЗ
	 |	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
	 |		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыРазличные КАК ТоварыРазличные
	 |		ПО ИСТИНА
	 |ГДЕ
	 |	ВариантыКомплектацииНоменклатурыТовары.Ссылка В (ВЫБРАТЬ РАЗЛИЧНЫЕ Т.ВариантКомплектацииНоменклатуры ИЗ ТаблицаТоваров КАК Т)
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	ТоварыРазличные.Ссылка,
	 |	ВариантыКомплектацииНоменклатурыТовары.Ссылка,
	 |	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец,
	 |	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Характеристика,
	 |	ВариантыКомплектацииНоменклатурыТовары.Номенклатура,
	 |	ВариантыКомплектацииНоменклатурыТовары.Характеристика,
	 |	ВариантыКомплектацииНоменклатурыТовары.Упаковка
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	Таблица.Ссылка,
	 |	Таблица.ВариантКомплектацииНоменклатуры,
	 |	Таблица.ВариантРасчетаЦеныНабора,
	 |	Таблица.ВариантПредставленияНабораВПечатныхФормах,
	 |	Таблица.НоменклатураНабора,
	 |	Таблица.ХарактеристикаНабора,
	 |	Таблица.Номенклатура,
	 |	Таблица.Характеристика,
	 |	МАКСИМУМ(Таблица.НомерГТД) КАК НомерГТД,
	 |	МАКСИМУМ(Таблица.СтавкаНДС) КАК СтавкаНДС,
	 |	МАКСИМУМ(Таблица.ОсновнаяКомплектующая) КАК ОсновнаяКомплектующая,
	 |	СУММА(Таблица.КоличествоПоУмолчанию) КАК КоличествоПоУмолчанию,
	 |	СУММА(Таблица.КоличествоДо) КАК КоличествоДо,
	 |	СУММА(Таблица.Количество) КАК Количество,
	 |	СУММА(Таблица.КоличествоПоРНПТДо) КАК КоличествоПоРНПТДо,
	 |	СУММА(Таблица.КоличествоПоРНПТУвеличение) КАК КоличествоПоРНПТУвеличение,
	 |	СУММА(Таблица.КоличествоПоРНПТУменьшение) КАК КоличествоПоРНПТУменьшение,
	 |	СУММА(Таблица.КоличествоПоРНПТ) КАК КоличествоПоРНПТ
	 |ПОМЕСТИТЬ ВременнаяТаблицаНаборыДополнительноЧастьВторая
	 |ИЗ
	 |	ВременнаяТаблицаНаборыДополнительноЧастьПервая КАК Таблица
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	Таблица.Ссылка,
	 |	Таблица.ВариантКомплектацииНоменклатуры,
	 |	Таблица.ВариантРасчетаЦеныНабора,
	 |	Таблица.ВариантПредставленияНабораВПечатныхФормах,
	 |	Таблица.НоменклатураНабора,
	 |	Таблица.ХарактеристикаНабора,
	 |	Таблица.Номенклатура,
	 |	Таблица.Характеристика
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	Результат.Ссылка,
	 |	Результат.ВариантКомплектацииНоменклатуры,
	 |	Результат.ВариантРасчетаЦеныНабора,
	 |	Результат.ВариантПредставленияНабораВПечатныхФормах,
	 |	Результат.НоменклатураНабора,
	 |	Результат.ХарактеристикаНабора,
	 |	МАКСИМУМ(ВЫБОР
	 |			КОГДА Результат.ОсновнаяКомплектующая
	 |				ТОГДА Результат.СтавкаНДС
	 |			ИНАЧЕ null
	 |		КОНЕЦ) КАК СтавкаНДС,
	 |	МАКСИМУМ(Результат.НомерГТД) КАК НомерГТД,
	 |	ВЫРАЗИТЬ(МИНИМУМ(ВЫБОР
	 |			КОГДА Результат.КоличествоПоУмолчанию <> 0 И Результат.ОсновнаяКомплектующая
	 |				ТОГДА Результат.Количество / Результат.КоличествоПоУмолчанию
	 |			ИНАЧЕ null
	 |		КОНЕЦ) + 0.5 КАК Число(10,0)) - 1 КАК Количество,
	 |	ВЫРАЗИТЬ(МИНИМУМ(ВЫБОР
	 |			КОГДА Результат.КоличествоПоУмолчанию <> 0 И Результат.ОсновнаяКомплектующая
	 |				ТОГДА Результат.КоличествоДо / Результат.КоличествоПоУмолчанию
	 |			ИНАЧЕ null
	 |		КОНЕЦ) + 0.5 КАК Число(10,0)) - 1 КАК КоличествоДо,
	 |	МАКСИМУМ(Результат.КоличествоПоРНПТ) КАК КоличествоПоРНПТ,
	 |	МАКСИМУМ(Результат.КоличествоПоРНПТДо) КАК КоличествоПоРНПТДо,
	 |	МАКСИМУМ(Результат.КоличествоПоРНПТУвеличение) КАК КоличествоПоРНПТУвеличение,
	 |	МАКСИМУМ(Результат.КоличествоПоРНПТУменьшение) КАК КоличествоПоРНПТУменьшение,
	 |	МАКСИМУМ(ВЫБОР
	 |			КОГДА Результат.КоличествоПоУмолчанию <> 0
	 |				ТОГДА Результат.Количество / Результат.КоличествоПоУмолчанию
	 |			ИНАЧЕ null
	 |		КОНЕЦ) КАК КоэффициентМаксимум,
	 |	ВЫРАЗИТЬ(МИНИМУМ(ВЫБОР
	 |			КОГДА Результат.КоличествоПоУмолчанию <> 0
	 |				ТОГДА Результат.Количество / Результат.КоличествоПоУмолчанию
	 |			ИНАЧЕ null
	 |		КОНЕЦ) + 0.5 КАК Число(10,0)) - 1 КАК КоэффициентМинимум
	 |ПОМЕСТИТЬ ВременнаяТаблицаНаборыДополнительно
	 |ИЗ
	 |	ВременнаяТаблицаНаборыДополнительноЧастьВторая КАК Результат
	 |СГРУППИРОВАТЬ ПО
	 |	Результат.Ссылка,
	 |	Результат.ВариантКомплектацииНоменклатуры,
	 |	Результат.ВариантРасчетаЦеныНабора,
	 |	Результат.ВариантПредставленияНабораВПечатныхФормах,
	 |	Результат.НоменклатураНабора,
	 |	Результат.ХарактеристикаНабора
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ВременнаяТаблицаНаборыДополнительно.ВариантКомплектацииНоменклатуры,
	 |
	 |	ВЫБОР КОГДА ДанныеОснований.ХозяйственнаяОперация В (&ХозяйственныеОперацииПередачаНаКомиссию)
	 |			И ВременнаяТаблицаНаборыДополнительно.ВариантПредставленияНабораВПечатныхФормах = &ВариантТолькоНабор ТОГДА
	 |		&ВариантНаборИКомплектующие
	 |	ИНАЧЕ
	 |		ВременнаяТаблицаНаборыДополнительно.ВариантПредставленияНабораВПечатныхФормах
	 |	КОНЕЦ КАК ВариантПредставленияНабораВПечатныхФормах,
	 |
	 |	ВЫБОР КОГДА ДанныеОснований.ХозяйственнаяОперация В (&ХозяйственныеОперацииПередачаНаКомиссию) ТОГДА
	 |		ВЫБОР КОГДА
	 |			ВЫБОР КОГДА ВременнаяТаблицаНаборыДополнительно.ВариантПредставленияНабораВПечатныхФормах = &ВариантТолькоНабор ТОГДА
	 |				&ВариантНаборИКомплектующие
	 |			ИНАЧЕ
	 |				ВременнаяТаблицаНаборыДополнительно.ВариантПредставленияНабораВПечатныхФормах
	 |			КОНЕЦ = &ВариантНаборИКомплектующие
	 |			И ВременнаяТаблицаНаборыДополнительно.ВариантРасчетаЦеныНабора В (
	 |				ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.ЦенаЗадаетсяЗаНаборРаспределяетсяПоЦенам),
	 |				ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.ЦенаЗадаетсяЗаНаборРаспределяетсяПоДолям)) ТОГДА
	 |
	 |			ЗНАЧЕНИЕ(Перечисление.ВариантыРасчетаЦенНаборов.РассчитываетсяИзЦенКомплектующих)
	 |		ИНАЧЕ
	 |			ВременнаяТаблицаНаборыДополнительно.ВариантРасчетаЦеныНабора
	 |		КОНЕЦ
	 |	ИНАЧЕ
	 |		ВременнаяТаблицаНаборыДополнительно.ВариантРасчетаЦеныНабора
	 |	КОНЕЦ КАК ВариантРасчетаЦеныНабора,
	 |
	 |	Таблица.Ссылка                            КАК Ссылка,
	 |	Таблица.НоменклатураНабора                КАК НоменклатураНабора,
	 |	Таблица.ХарактеристикаНабора              КАК ХарактеристикаНабора,
	 |	Таблица.НомерСтроки                       КАК НомерСтроки,
	 |	Таблица.НомерСтрокиИсходногоСФ            КАК НомерСтрокиИсходногоСФ,
	 |	ЕСТЬNULL(ВременнаяТаблицаНаборыДополнительно.Количество, 1) КАК КоличествоУпаковок,
	 |	ЕСТЬNULL(ВременнаяТаблицаНаборыДополнительно.Количество, 1) КАК Количество,
	 |	ЕСТЬNULL(ВременнаяТаблицаНаборыДополнительно.КоличествоПоРНПТ, 1) КАК КоличествоПоРНПТ,
	 |	ВЫБОР КОГДА ВременнаяТаблицаНаборыДополнительно.КоэффициентМинимум = ВременнаяТаблицаНаборыДополнительно.КоэффициентМаксимум ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ПолныйНабор,
	 |	Таблица.СуммаБезНДС                       КАК СуммаБезНДС,
	 |	Таблица.СуммаНДС                          КАК СуммаНДС,
	 |	ЕСТЬNULL(ВременнаяТаблицаНаборыДополнительно.КоличествоДо, 1) КАК КоличествоУпаковокДо,
	 |	ЕСТЬNULL(ВременнаяТаблицаНаборыДополнительно.КоличествоДо, 1) КАК КоличествоДо,
	 |	ЕСТЬNULL(ВременнаяТаблицаНаборыДополнительно.КоличествоПоРНПТДо, 1) КАК КоличествоПоРНПТДо,
	 |	ЕСТЬNULL(ВременнаяТаблицаНаборыДополнительно.КоличествоПоРНПТУвеличение, 1) КАК КоличествоПоРНПТУвеличение,
	 |	ЕСТЬNULL(ВременнаяТаблицаНаборыДополнительно.КоличествоПоРНПТУменьшение, 1) КАК КоличествоПоРНПТУменьшение,
	 |	Таблица.СуммаБезНДСДо                     КАК СуммаБезНДСДо,
	 |	Таблица.СуммаНДСДо                        КАК СуммаНДСДо,
	 |	Таблица.РазницаБезНДСУвеличение           КАК РазницаБезНДСУвеличение,
	 |	Таблица.РазницаБезНДСУменьшение           КАК РазницаБезНДСУменьшение,
	 |	Таблица.РазницаНДСУвеличение              КАК РазницаНДСУвеличение,
	 |	Таблица.РазницаНДСУменьшение              КАК РазницаНДСУменьшение,
	 |	Таблица.РазницаСНДСУвеличение             КАК РазницаСНДСУвеличение,
	 |	Таблица.РазницаСНДСУменьшение             КАК РазницаСНДСУменьшение,
	 |	Таблица.КодТНВЭД                          КАК КодТНВЭД,
	 |	Таблица.СтавкаНДС                         КАК СтавкаНДС,
	 |	ЕСТЬNULL(ВременнаяТаблицаНаборыДополнительно.НомерГТД, ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)) КАК НомерГТД,
	 |	Таблица.СсылкаСФ                          КАК СсылкаСФ,
	 |	Таблица.Покупатель                        КАК Покупатель,
	 |	Таблица.НомерСчетаФактуры                 КАК НомерСчетаФактуры
	 |ПОМЕСТИТЬ ВременнаяТаблицаНаборы
	 |ИЗ
	 |	ВременнаяТаблицаНаборыПодготовка КАК Таблица
	 |		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаНаборыДополнительно КАК ВременнаяТаблицаНаборыДополнительно
	 |		ПО Таблица.НоменклатураНабора = ВременнаяТаблицаНаборыДополнительно.НоменклатураНабора
	 |		И Таблица.ХарактеристикаНабора = ВременнаяТаблицаНаборыДополнительно.ХарактеристикаНабора
	 |		И Таблица.Ссылка = ВременнаяТаблицаНаборыДополнительно.Ссылка
	 |	
	 |	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокументов КАК ДанныеОснований
	 |	ПО ДанныеОснований.Ссылка = Таблица.Ссылка
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |";

	 ТекстРезультирующейТаблицы = 
	 "ВЫБРАТЬ
	 |	ТаблицаТоваров.Ссылка                                    КАК Ссылка,
	 |	ТаблицаТоваров.НомерСтроки                               КАК НомерСтроки,
	 |	ТаблицаТоваров.НомерСтрокиИсходногоСФ                    КАК НомерСтрокиИсходногоСФ,
	 |	ТаблицаТоваров.Номенклатура                              КАК Номенклатура,
	 |	ТаблицаТоваров.НоменклатураПартнера                      КАК НоменклатураПартнера,
	 |	ВЫБОР КОГДА ТаблицаТоваров.Содержание = """" ТОГДА
	 |		ДанныеНоменклатуры.НаименованиеПолное
	 |	ИНАЧЕ 
	 |		ТаблицаТоваров.Содержание
	 |	КОНЕЦ                                                    КАК НоменклатураНаименование,
	 |	ВЫБОР КОГДА &КолонкаКодов = ""Артикул"" ТОГДА
	 |		ДанныеНоменклатуры.Артикул
	 |	ИНАЧЕ
	 |		ДанныеНоменклатуры.Код
	 |	КОНЕЦ                                                    КАК НоменклатураКод,
	 |	ТаблицаТоваров.КодТНВЭД                                  КАК КодТНВЭД,
	 |	ВЫБОР
	 |		КОГДА ДанныеНоменклатуры.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	 |				И ТаблицаТоваров.ВернутьМногооборотнуюТару
	 |			ТОГДА ИСТИНА
	 |		ИНАЧЕ ЛОЖЬ
	 |	КОНЕЦ                                                    КАК ЭтоВозвратнаяТара,
	 |	ВЫБОР
	 |		КОГДА &ВыводитьБазовыеЕдиницыИзмерения И ТаблицаТоваров.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	 |				И ТаблицаТоваров.Номенклатура <> НЕОПРЕДЕЛЕНО
	 |			ТОГДА ДанныеНоменклатуры.ЕдиницаИзмерения
	 |		ИНАЧЕ &ТекстЗапросаЕдиницаИзмерения
	 |	КОНЕЦ                                                    КАК ЕдиницаИзмерения,
	 |	ВЫБОР КОГДА ТаблицаТоваров.Содержание = """" ТОГДА
	 |		ТаблицаТоваров.Характеристика
	 |	ИНАЧЕ 
	 |		""""
	 |	КОНЕЦ                                                    КАК Характеристика,
	 |	ВЫБОР КОГДА ТаблицаТоваров.Содержание = """" ТОГДА
	 |		ТаблицаТоваров.Серия
	 |	ИНАЧЕ 
	 |		ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	 |	КОНЕЦ                                                    КАК Серия,
	 |
	 |	ТаблицаТоваров.НомерГТД                                  КАК НомерГТД,
	 |	ТаблицаТоваров.СтавкаНДС                                 КАК СтавкаНДС,
	 |	ТаблицаТоваров.Упаковка                                  КАК Упаковка,
	 |
	 |//РеквизитыТаблицыНаборов
	 |
	 |	ВЫБОР КОГДА &ВыводитьБазовыеЕдиницыИзмерения ТОГДА
	 |		ТаблицаТоваров.Количество
	 |	КОГДА ТаблицаТоваров.КоличествоУпаковок = 0 ТОГДА
	 |		ТаблицаТоваров.Количество
	 |	ИНАЧЕ
	 |		ТаблицаТоваров.КоличествоУпаковок
	 |	КОНЕЦ                                                    КАК Количество,
	 |	ВЫБОР КОГДА &ВыводитьБазовыеЕдиницыИзмерения ТОГДА
	 |		ТаблицаТоваров.КоличествоДо
	 |	КОГДА ТаблицаТоваров.КоличествоУпаковокДо = 0 ТОГДА
	 |		ТаблицаТоваров.КоличествоДо
	 |	ИНАЧЕ
	 |		ТаблицаТоваров.КоличествоУпаковокДо
	 |	КОНЕЦ                                                    КАК КоличествоДо,
	 |	ТаблицаТоваров.Количество                                КАК КоличествоБазовыхЕдиниц,
	 |	ТаблицаТоваров.КоличествоДо                              КАК КоличествоБазовыхЕдиницДо,
	 |	ТаблицаТоваров.КоличествоПоРНПТ                          КАК КоличествоПоРНПТ,
	 |	ТаблицаТоваров.КоличествоПоРНПТДо                        КАК КоличествоПоРНПТДо,
	 |	ТаблицаТоваров.КоличествоПоРНПТУвеличение                КАК КоличествоПоРНПТУвеличение,
	 |	ТаблицаТоваров.КоличествоПоРНПТУменьшение                КАК КоличествоПоРНПТУменьшение,
	 |	ВЫРАЗИТЬ(ВЫБОР КОГДА ТаблицаТоваров.Количество = 0 ТОГДА
	 |		0
	 |	КОГДА &ВыводитьБазовыеЕдиницыИзмерения ТОГДА
	 |		ТаблицаТоваров.СуммаБезНДС / ТаблицаТоваров.Количество
	 |	КОГДА ТаблицаТоваров.КоличествоУпаковок = 0 ТОГДА
	 |		ТаблицаТоваров.СуммаБезНДС / ТаблицаТоваров.Количество
	 |	ИНАЧЕ
	 |		ТаблицаТоваров.СуммаБезНДС / ТаблицаТоваров.КоличествоУпаковок
	 |	КОНЕЦ КАК ЧИСЛО(21,8))                                   КАК Цена,
	 |	ВЫБОР КОГДА ТаблицаТоваров.КоличествоДо = 0 ТОГДА
	 |		0
	 |	КОГДА &ВыводитьБазовыеЕдиницыИзмерения ТОГДА
	 |		ТаблицаТоваров.СуммаБезНДСДо / ТаблицаТоваров.КоличествоДо
	 |	КОГДА ТаблицаТоваров.КоличествоУпаковокДо = 0 ТОГДА
	 |		ТаблицаТоваров.СуммаБезНДСДо / ТаблицаТоваров.КоличествоДо
	 |	ИНАЧЕ
	 |		ТаблицаТоваров.СуммаБезНДСДо / ТаблицаТоваров.КоличествоУпаковокДо
	 |	КОНЕЦ                                                    КАК ЦенаДо,
	 |	ТаблицаТоваров.СуммаБезНДС                               КАК СуммаБезНДС,
	 |	ТаблицаТоваров.СуммаБезНДСДо                             КАК СуммаБезНДСДо,
	 |	ТаблицаТоваров.СуммаНДС                                  КАК СуммаНДС,
	 |	ТаблицаТоваров.СуммаНДСДо                                КАК СуммаНДСДо,
	 |	ТаблицаТоваров.МежценоваяРазница                         КАК МежценоваяРазница,
	 |	ТаблицаТоваров.МежценоваяРазницаДо                       КАК МежценоваяРазницаДо,
	 |	ТаблицаТоваров.РазницаБезНДСУвеличение                   КАК РазницаБезНДСУвеличение,
	 |	ТаблицаТоваров.РазницаБезНДСУменьшение                   КАК РазницаБезНДСУменьшение,
	 |	ТаблицаТоваров.РазницаНДСУвеличение                      КАК РазницаНДСУвеличение,
	 |	ТаблицаТоваров.РазницаНДСУменьшение                      КАК РазницаНДСУменьшение,
	 |	ТаблицаТоваров.РазницаСНДСУвеличение                     КАК РазницаСНДСУвеличение,
	 |	ТаблицаТоваров.РазницаСНДСУменьшение                     КАК РазницаСНДСУменьшение,
	 |	ТаблицаТоваров.СсылкаСФ                                  КАК СсылкаСФ,
	 |	ТаблицаТоваров.Покупатель                                КАК Покупатель,
	 |	ТаблицаТоваров.НомерСчетаФактуры                         КАК НомерСчетаФактуры
	 |
	 |ПОМЕСТИТЬ ТаблицаТоваровДокументов
	 |ИЗ
	 |	ТаблицаТоваров КАК ТаблицаТоваров
	 |//СоединениеТаблицыНаборов
	 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК ДанныеНоменклатуры
	 |		ПО ТаблицаТоваров.Номенклатура = ДанныеНоменклатуры.Ссылка
	 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК ДанныеУпаковки
	 |		ПО НЕ &ВыводитьБазовыеЕдиницыИзмерения
	 |			И ТаблицаТоваров.Упаковка = ДанныеУпаковки.Ссылка
	 |ГДЕ
	 |	ТаблицаТоваров.НоменклатураНабора = &ПустаяНоменклатура
	 |	ИЛИ (ТаблицаТоваров.НоменклатураНабора <> &ПустаяНоменклатура
	 |		И ТаблицаТоваров.ВариантПредставленияНабораВПечатныхФормах В (
	 |		&ВариантТолькоКомплектующие, &ВариантНаборИКомплектующие))";

	 Если ЕстьНаборы Тогда

		 ТекстРезультирующейТаблицы = СтрЗаменить(ТекстРезультирующейТаблицы, "//РеквизитыТаблицыНаборов",
		 "	ВЫБОР КОГДА ЕСТЬNULL(ВременнаяТаблицаНаборы.НомерСтроки, 0) <> 0 ТОГДА
		 |		ВременнаяТаблицаНаборы.НомерСтроки
		 |	ИНАЧЕ
		 |		ТаблицаТоваров.НомерСтроки
		 |	КОНЕЦ                                                    КАК НомерСтрокиНаборы,
		 |	ВЫБОР КОГДА ЕСТЬNULL(ВременнаяТаблицаНаборы.НомерСтроки, 0) <> 0 ТОГДА
		 |		ВременнаяТаблицаНаборы.ВариантПредставленияНабораВПечатныхФормах
		 |	ИНАЧЕ
		 |		&ПустойВариантПредставленияНаборов
		 |	КОНЕЦ                                                    КАК ВариантПредставленияНабораВПечатныхФормах,
		 |	ВЫБОР КОГДА ЕСТЬNULL(ВременнаяТаблицаНаборы.НомерСтроки, 0) <> 0 ТОГДА
		 |		ВременнаяТаблицаНаборы.ВариантРасчетаЦеныНабора
		 |	ИНАЧЕ
		 |		&ПустойВариантРасчетаЦенНаборов
		 |	КОНЕЦ                                                    КАК ВариантРасчетаЦеныНабора,
		 |	ТаблицаТоваров.НоменклатураНабора                        КАК НоменклатураНабора,
		 |	ТаблицаТоваров.ХарактеристикаНабора                      КАК ХарактеристикаНабора,
		 |	ВЫБОР КОГДА ЕСТЬNULL(ВременнаяТаблицаНаборы.НомерСтроки, 0) <> 0 ТОГДА
		 |		ИСТИНА
		 |	ИНАЧЕ
		 |		ЛОЖЬ
		 |	КОНЕЦ                                                    КАК ЭтоКомплектующие,
		 |	ЛОЖЬ                                                     КАК ЭтоНабор,
		 |	ВЫБОР КОГДА ЕСТЬNULL(ВременнаяТаблицаНаборы.НомерСтроки, 0) <> 0 ТОГДА
		 |		ВременнаяТаблицаНаборы.ПолныйНабор
		 |	ИНАЧЕ
		 |		ЛОЖЬ
		 |	КОНЕЦ                                                    КАК ПолныйНабор,");

		 ТекстРезультирующейТаблицы = СтрЗаменить(ТекстРезультирующейТаблицы, "//СоединениеТаблицыНаборов",
		 "		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаНаборы КАК ВременнаяТаблицаНаборы
		 |		ПО ВременнаяТаблицаНаборы.НоменклатураНабора = ТаблицаТоваров.НоменклатураНабора
		 |			И ВременнаяТаблицаНаборы.ХарактеристикаНабора = ТаблицаТоваров.ХарактеристикаНабора
		 |			И ВременнаяТаблицаНаборы.Ссылка = ТаблицаТоваров.Ссылка
		 |			И ВременнаяТаблицаНаборы.СтавкаНДС = ТаблицаТоваров.СтавкаНДС");

		 ТекстРезультирующейТаблицы = ТекстРезультирующейТаблицы + "
		 |
		 |ОБЪЕДИНИТЬ ВСЕ
		 |" +

		 "ВЫБРАТЬ
		 |	ВременнаяТаблицаНаборы.Ссылка               КАК Ссылка,
		 |	0                                           КАК НомерСтроки,
		 |	ВременнаяТаблицаНаборы.НомерСтрокиИсходногоСФ КАК НомерСтрокиИсходногоСФ,
		 |	ВременнаяТаблицаНаборы.НоменклатураНабора   КАК Номенклатура,
		 |	ЗНАЧЕНИЕ(Справочник.НоменклатураКонтрагентов.ПустаяСсылка) КАК НоменклатураПартнера,
		 |	ДанныеНоменклатуры.НаименованиеПолное       КАК НоменклатураНаименование,
		 |	ВЫБОР КОГДА &КолонкаКодов = ""Артикул"" ТОГДА
		 |		ДанныеНоменклатуры.Артикул
		 |	ИНАЧЕ
		 |		ДанныеНоменклатуры.Код
		 |	КОНЕЦ                                       КАК НоменклатураКод,
		 |	ВременнаяТаблицаНаборы.КодТНВЭД             КАК КодТНВЭД,
		 |	ЛОЖЬ                                        КАК ЭтоВозвратнаяТара,
		 |	ДанныеНоменклатуры.ЕдиницаИзмерения         КАК ЕдиницаИзмерения,
		 |	ВременнаяТаблицаНаборы.ХарактеристикаНабора КАК Характеристика,
		 |	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
		 |	ВременнаяТаблицаНаборы.НомерГТД             КАК НомерГТД,
		 |	ВременнаяТаблицаНаборы.СтавкаНДС КАК СтавкаНДС,
		 |	ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) КАК Упаковка,		
		 |	ВременнаяТаблицаНаборы.НомерСтроки КАК НомерСтрокиНаборы,
		 |	ВременнаяТаблицаНаборы.ВариантПредставленияНабораВПечатныхФормах КАК ВариантПредставленияНабораВПечатныхФормах,
		 |	ВременнаяТаблицаНаборы.ВариантРасчетаЦеныНабора                  КАК ВариантРасчетаЦеныНабора,
		 |	ВременнаяТаблицаНаборы.НоменклатураНабора                        КАК НоменклатураНабора,
		 |	ВременнаяТаблицаНаборы.ХарактеристикаНабора                      КАК ХарактеристикаНабора,
		 |	ЛОЖЬ                                                             КАК ЭтоКомплектующие,
		 |	ИСТИНА                                                           КАК ЭтоНабор,
		 |	ВременнаяТаблицаНаборы.ПолныйНабор                               КАК ПолныйНабор,
		 |
		 |	ВЫБОР КОГДА &ВыводитьБазовыеЕдиницыИзмерения ТОГДА
		 |		ВременнаяТаблицаНаборы.Количество
		 |	ИНАЧЕ
		 |		ВременнаяТаблицаНаборы.КоличествоУпаковок
		 |	КОНЕЦ                                       КАК Количество,
		 |	ВЫБОР КОГДА &ВыводитьБазовыеЕдиницыИзмерения ТОГДА
		 |		ВременнаяТаблицаНаборы.КоличествоДо
		 |	ИНАЧЕ
		 |		ВременнаяТаблицаНаборы.КоличествоУпаковокДо
		 |	КОНЕЦ                                                    КАК КоличествоДо,
		 |	ВременнаяТаблицаНаборы.Количество                        КАК КоличествоБазовыхЕдиниц,
		 |	ВременнаяТаблицаНаборы.КоличествоДо                      КАК КоличествоБазовыхЕдиницДо,
		 |	ВременнаяТаблицаНаборы.КоличествоПоРНПТ                  КАК КоличествоПоРНПТ,
		 |	ВременнаяТаблицаНаборы.КоличествоПоРНПТДо                КАК КоличествоПоРНПТДо,
		 |	ВременнаяТаблицаНаборы.КоличествоПоРНПТУвеличение        КАК КоличествоПоРНПТУвеличение,
		 |	ВременнаяТаблицаНаборы.КоличествоПоРНПТУменьшение        КАК КоличествоПоРНПТУменьшение,
		 |	ВЫБОР КОГДА ВременнаяТаблицаНаборы.Количество = 0 ТОГДА
		 |		0
		 |	КОГДА &ВыводитьБазовыеЕдиницыИзмерения ТОГДА
		 |		ВременнаяТаблицаНаборы.СуммаБезНДС / ВременнаяТаблицаНаборы.Количество
		 |	ИНАЧЕ
		 |		ВременнаяТаблицаНаборы.СуммаБезНДС / ВременнаяТаблицаНаборы.КоличествоУпаковок
		 |	КОНЕЦ                                       КАК Цена,
		 |	ВЫБОР КОГДА ВременнаяТаблицаНаборы.КоличествоДо = 0 ТОГДА
		 |		0
		 |	КОГДА &ВыводитьБазовыеЕдиницыИзмерения ТОГДА
		 |		ВременнаяТаблицаНаборы.СуммаБезНДСДо / ВременнаяТаблицаНаборы.КоличествоДо
		 |	ИНАЧЕ
		 |		ВременнаяТаблицаНаборы.СуммаБезНДСДо / ВременнаяТаблицаНаборы.КоличествоУпаковокДо
		 |	КОНЕЦ                                             КАК ЦенаДо,
		 |	ВременнаяТаблицаНаборы.СуммаБезНДС                КАК СуммаБезНДС,
		 |	ВременнаяТаблицаНаборы.СуммаБезНДСДо              КАК СуммаБезНДСДо,
		 |	ВременнаяТаблицаНаборы.СуммаНДС                   КАК СуммаНДС,
		 |	ВременнаяТаблицаНаборы.СуммаНДСДо                 КАК СуммаНДСДо,
		 |	0                                                 КАК МежценоваяРазница,
		 |	0                                                 КАК МежценоваяРазницаДо,
		 |	ВременнаяТаблицаНаборы.РазницаБезНДСУвеличение    КАК РазницаБезНДСУвеличение,
		 |	ВременнаяТаблицаНаборы.РазницаБезНДСУменьшение    КАК РазницаБезНДСУменьшение,
		 |	ВременнаяТаблицаНаборы.РазницаНДСУвеличение       КАК РазницаНДСУвеличение,
		 |	ВременнаяТаблицаНаборы.РазницаНДСУменьшение       КАК РазницаНДСУменьшение,
		 |	ВременнаяТаблицаНаборы.РазницаСНДСУвеличение      КАК РазницаСНДСУвеличение,
		 |	ВременнаяТаблицаНаборы.РазницаСНДСУменьшение      КАК РазницаСНДСУменьшение,
		 |	ВременнаяТаблицаНаборы.СсылкаСФ                   КАК СсылкаСФ,
		 |	ВременнаяТаблицаНаборы.Покупатель                 КАК Покупатель,
		 |	ВременнаяТаблицаНаборы.НомерСчетаФактуры          КАК НомерСчетаФактуры
		 |
		 |ИЗ
		 |	ВременнаяТаблицаНаборы КАК ВременнаяТаблицаНаборы
		 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК ДанныеНоменклатуры
		 |		ПО ВременнаяТаблицаНаборы.НоменклатураНабора = ДанныеНоменклатуры.Ссылка
		 |
		 |ГДЕ
		 |	ВременнаяТаблицаНаборы.ВариантПредставленияНабораВПечатныхФормах В (
		 |		&ВариантТолькоНабор, &ВариантНаборИКомплектующие)";

	 Иначе

		 ТекстРезультирующейТаблицы = СтрЗаменить(ТекстРезультирующейТаблицы, "//РеквизитыТаблицыНаборов",
		 "	ТаблицаТоваров.НомерСтроки          КАК НомерСтрокиНаборы,
		 |	&ПустойВариантПредставленияНаборов  КАК ВариантПредставленияНабораВПечатныхФормах,
		 |	&ПустойВариантРасчетаЦенНаборов     КАК ВариантРасчетаЦеныНабора,
		 |	ТаблицаТоваров.НоменклатураНабора   КАК НоменклатураНабора,
		 |	ТаблицаТоваров.ХарактеристикаНабора КАК ХарактеристикаНабора,
		 |	ЛОЖЬ                                КАК ЭтоКомплектующие,
		 |	ЛОЖЬ                                КАК ЭтоНабор,
		 |	ЛОЖЬ                                КАК ПолныйНабор,");

	 КонецЕсли;

	 Запрос.Текст = ТекстОбщейТаблицыТовары +
	 ?(ЕстьНаборы, ТекстТаблицыНаборов, "") +
	 ТекстРезультирующейТаблицы;

	 Запрос.Текст = СтрЗаменить(
	 Запрос.Текст,
	 "&ТекстЗапросаЕдиницаИзмерения",
	 Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаЗначениеРеквизитаЕдиницыИзмерения(
	 "Ссылка",
	 "ТаблицаТоваров.Упаковка",
	 ?(ИмяОбъекта = "РеализацияУслугПрочихАктивов","","ТаблицаТоваров.Номенклатура")));

	 Запрос.УстановитьПараметр("ВыводитьБазовыеЕдиницыИзмерения", Константы.ВыводитьБазовыеЕдиницыИзмерения.Получить());
	 Запрос.УстановитьПараметр("ПустаяНоменклатура", Справочники.Номенклатура.ПустаяСсылка());

	 КолонкаКодов = ФормированиеПечатныхФорм.ДополнительнаяКолонкаПечатныхФормДокументов().ИмяКолонки;
	 Если Не ЗначениеЗаполнено(КолонкаКодов) Тогда
		 КолонкаКодов = "Код";
	 КонецЕсли;
	 Запрос.УстановитьПараметр("КолонкаКодов", КолонкаКодов);

	 Запрос.УстановитьПараметр("ВариантТолькоНабор", Перечисления.ВариантыПредставленияНаборовВПечатныхФормах.ТолькоНабор);
	 Запрос.УстановитьПараметр("ВариантТолькоКомплектующие",
	 Перечисления.ВариантыПредставленияНаборовВПечатныхФормах.ТолькоКомплектующие);
	 Запрос.УстановитьПараметр("ВариантНаборИКомплектующие",
	 Перечисления.ВариантыПредставленияНаборовВПечатныхФормах.НаборИКомплектующие);
	 Запрос.УстановитьПараметр("ПустойВариантПредставленияНаборов",
	 Перечисления.ВариантыПредставленияНаборовВПечатныхФормах.ПустаяСсылка());
	 Запрос.УстановитьПараметр("ПустойВариантРасчетаЦенНаборов", Перечисления.ВариантыРасчетаЦенНаборов.ПустаяСсылка());

	 МассивОперацийПередачаНаКомиссию = Новый Массив;
	 МассивОперацийПередачаНаКомиссию.Добавить(Перечисления.ХозяйственныеОперации.ВозвратТоваровКомитенту);
	 МассивОперацийПередачаНаКомиссию.Добавить(Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию);
	 МассивОперацийПередачаНаКомиссию.Добавить(Перечисления.ХозяйственныеОперации.ПередачаНаКомиссиюВДругуюОрганизацию);
	 Запрос.УстановитьПараметр("ХозяйственныеОперацииПередачаНаКомиссию", МассивОперацийПередачаНаКомиссию);

	 Запрос.УстановитьПараметр("МассивОснований", МассивОснований);
	 Запрос.Текст = Запрос.Текст +
	 "
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ТаблицаДокумента.Ссылка,
	 |	ТаблицаДокумента.ШтрихкодУпаковки
	 |ПОМЕСТИТЬ ШтрихкодыУпаковок
	 |ИЗ
	 |	Документ.РеализацияТоваровУслуг.ШтрихкодыУпаковок КАК ТаблицаДокумента
	 |ГДЕ
	 |	ТаблицаДокумента.Ссылка В (&МассивОснований)
	 |
	 |ОБЪЕДИНИТЬ ВСЕ
	 |
	 |ВЫБРАТЬ
	 |	ТаблицаДокумента.Ссылка,
	 |	ТаблицаДокумента.ШтрихкодУпаковки
	 |ИЗ
	 |	Документ.ВозвратТоваровПоставщику.ШтрихкодыУпаковок КАК ТаблицаДокумента
	 |ГДЕ
	 |	ТаблицаДокумента.Ссылка В (&МассивОснований)
	 |
	 |ОБЪЕДИНИТЬ ВСЕ
	 |
	 |ВЫБРАТЬ
	 |	ТаблицаДокумента.Ссылка,
	 |	ТаблицаДокумента.ШтрихкодУпаковки
	 |ИЗ
	 |	Документ.ПередачаТоваровМеждуОрганизациями.ШтрихкодыУпаковок КАК ТаблицаДокумента
	 |ГДЕ
	 |	ТаблицаДокумента.Ссылка В (&МассивОснований)
	 |
	 |ОБЪЕДИНИТЬ ВСЕ
	 |
	 |ВЫБРАТЬ
	 |	ТаблицаДокумента.Ссылка,
	 |	ТаблицаДокумента.ШтрихкодУпаковки
	 |ИЗ
	 |	Документ.ВозвратТоваровМеждуОрганизациями.ШтрихкодыУпаковок КАК ТаблицаДокумента
	 |ГДЕ
	 |	ТаблицаДокумента.Ссылка В (&МассивОснований)
	 |
	 |ОБЪЕДИНИТЬ ВСЕ
	 |
	 |ВЫБРАТЬ
	 |	ТаблицаДокумента.Ссылка,
	 |	ТаблицаДокумента.ШтрихкодУпаковки
	 |ИЗ
	 |	Документ.КорректировкаРеализации.ШтрихкодыУпаковок КАК ТаблицаДокумента
	 |ГДЕ
	 |	ТаблицаДокумента.Ссылка В (&МассивОснований)
	 |
	 |ОБЪЕДИНИТЬ ВСЕ
	 |
	 |ВЫБРАТЬ
	 |	ТаблицаОснований.Ссылка,
	 |	ТаблицаДокумента.ШтрихкодУпаковки
	 |ИЗ
	 |	Документ.СчетФактураВыданный.ДокументыОснования КАК ТаблицаОснований
	 |	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации.ШтрихкодыУпаковок КАК ТаблицаДокумента
	 |		ПО ТаблицаОснований.ДокументОснование = ТаблицаДокумента.Ссылка
	 |ГДЕ
	 |	ТаблицаОснований.Ссылка В (&МассивОснований)
	 |	И (ТаблицаОснований.Ссылка.Корректировочный
	 |			ИЛИ ТаблицаОснований.Ссылка.Исправление)
	 |";

	 Если ПараметрыПечати.Свойство("ЗаполнитьДанныеШтрихкодовДляУКДДо") И ПараметрыПечати.ЗаполнитьДанныеШтрихкодовДляУКДДо Тогда

		 ПоместитьВременнуюТаблицуДанныеПоследнейКорректировки(МенеджерВременныхТаблиц);
		 Запрос.Текст = Запрос.Текст + 
		 "
		 |;
		 |
		 |////////////////////////////////////////////////////////////////////////////////
		 |ВЫБРАТЬ
		 |	ПредыдущиеДокументы.Основной КАК Ссылка,
		 |	ТаблицаШтрихкодовДо.Ссылка КАК ДокументРеализации,
		 |	ТаблицаШтрихкодовДо.ШтрихкодУпаковки КАК ШтрихкодУпаковки
		 |ПОМЕСТИТЬ ШтрихкодыУпаковокДо
		 |ИЗ
		 |	ПредыдущиеДокументы КАК ПредыдущиеДокументы
		 |	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации.ШтрихкодыУпаковок КАК ТаблицаШтрихкодовДо
		 |		ПО ПредыдущиеДокументы.Предыдущий = ТаблицаШтрихкодовДо.Ссылка
		 |
		 |ОБЪЕДИНИТЬ ВСЕ
		 |
		 |ВЫБРАТЬ
		 |	ПредыдущиеДокументы.Основной,
		 |	ТаблицаШтрихкодовДо.Ссылка,
		 |	ТаблицаШтрихкодовДо.ШтрихкодУпаковки
		 |ИЗ
		 |	ПредыдущиеДокументы КАК ПредыдущиеДокументы
		 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.ШтрихкодыУпаковок КАК ТаблицаШтрихкодовДо
		 |		ПО ПредыдущиеДокументы.Предыдущий = ТаблицаШтрихкодовДо.Ссылка
		 |
		 |ОБЪЕДИНИТЬ ВСЕ
		 |
		 |ВЫБРАТЬ
		 |	ТаблицаОснований.Ссылка,
		 |	ТаблицаДокумента.Ссылка,
		 |	ТаблицаДокумента.ШтрихкодУпаковки
		 |ИЗ
		 |	Документ.СчетФактураВыданный.ДокументыОснования КАК ТаблицаОснований
		 |	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтКлиента.ШтрихкодыУпаковок КАК ТаблицаДокумента
		 |		ПО ТаблицаОснований.ДокументОснование = ТаблицаДокумента.Ссылка
		 |ГДЕ
		 |	ТаблицаОснований.Ссылка В (&МассивОснований)
		 |	И (ТаблицаОснований.Ссылка.Корректировочный
		 |			ИЛИ ТаблицаОснований.Ссылка.Исправление)
		 |";

	 КонецЕсли;
	 //для корректировочного и исправительного с/ф приходит документ-основание = с/ф
	 //для обычного с/ф документ основание = реализация

	 Запрос.Выполнить();

	 ПараметрыПечати.ВыводитьНаборы = ЕстьНаборы;

 КонецПроцедуры
	
#КонецЕсли
